content/docs/others/asset_allocation.md
+++
title = "Asset Allocation"
author = ["Hrishikesh Barman"]
date = 2018-11-11T21:49:00+05:30
draft = false
+++

<div class="book-hint warning">

> I am the last person to take any financial advice from. Everything under this page is only for me based on the risks I can take and how stupid I can get. If you have any suggestions on how I can allocate my assets better, please feel free to ping me about it. Always happy to learn.
</div>


## Background Notes {#background-notes}

-   Focus on what can go wrong and take care of it first.
-   It's important to do financial planning and goal setting so that you can stop thinking about money and focus on learning, building things and career growth. This will lead to satisfaction as I gain satisfaction from learning things and at the same time, it will help maximize my income.
-   Having too many options will cause analysis paralysis.
-   Equity investments can be also be compared with growing gardens and trees. You can either acquire that skill or you can hire a gardener to do that for you. They key point is to have patience.
-   Learn when and how to exit, setup watchers for exit. Not knowing how and when to exit is like having the best water bottle in the world with a small hole. Asset allocation strategy is closely linked to withdrawal strategy.
-   Savings does not mean putting that money into your bank account, it could also mean investing it somewhere etc. creating assets that can give you direct value when needed.
-   Build the life of your dreams and then save for it.
-   Lifestyle inflation refers to the common phenomenon of increasing spending shown by people as their income increases.
-   Time billionaire : One billion seconds is 31 years (a career). If you have 31 years time of life, you're a time billionaire. I am 25 now, I am currently a time billionaire if not a money billionaire.


## Allocation {#allocation}


### General Notes {#general-notes}

-   I'll try to save 75% of my primary monthly income for the next 5 years.
-   With better incomes, lesser spending and more focus, the rate of savings will increase. Earn more, spend less. Most basic rule of saving.
-   If you have an impulse to buy something online, put a pause of 72 hours before you place the order. If you want to buy things you want, you have to save.
-   It's always good to start early, in my first year of job because I had no one telling me what to do with my money, I managed money very bad. It becomes, since I don't know what to do, I will do nothing. It was very stupid of me to do nothing.
-   For the dumbass that I am, the only formula I use to plan anything is the [SIP formula](<https://cred.club/calculators/sip-calculator>). There are three variables, `p`, `r` and `t` . As mere mortals, with hard and smart-work we can change the value of `p` . `r` and `t` are up-to sky homie. So I'll try to optimize `p` and make sane and safe decisions for `r` to be decent.
-   The biggest factor for financial independence is not your income, it is ****a sustainable savings rate****.
-   Ideal portfolio should be diversified not just asset-wise but also geographically.


### Distribution {#distribution}

-   60% defensive stocks (Diversified Indexes, Bonds, Debt)
-   25% slightly aggressive stocks (Picked Equity)
-   5% Crypto
-   10% build hedge (Cash, FD, Gold, Silver, Bitcoin)
-   Emergency Funds
    -   1L Immediate support fund
    -   5L kit-kat break from life support fund


#### Why hold some liquid debt funds {#why-hold-some-liquid-debt-funds}

-   FDs are safe, but you can't pull the money out if you need it immediately.
-   Equity can be volatile, but you can pull out the money. If there is an emergency someday, based on the nature of the emergency you might have to sell things at a loss because you need the money, even if you know for a fact that the stock will be going up sometime in the future.
-   Holding some money in a debt mutual fund allows you to always have certain amount of liquid money as they allow you to get your money back quickly. Liquid debt funds are also less volatile compared to equity, so chances that you'll be at a loss is probably less.


### Savings Buckets {#savings-buckets}


#### Bucket Instant Gratification (0-5 years) {#bucket-instant-gratification--0-5-years}

Money that is needed in 0-5 years goes here

-   Aim for 8-9% returns on these.
-   When subscribing, make sure to check for taxation and exit load etc.
-   These money go into liquid funds and FDs


#### Bucket Delayed Gratification (&gt;5 years) {#bucket-delayed-gratification--5-years}

Money that is needed in 6-7 years goes here

-   Aim for &gt;10% returns on these in the long term.
-   Since this is long term, subscribing for tax benefit plans can come here.
-   We can go aggressive here, because it's long term and we don't care if things do down in recent times. It's the long game. We can take big bets about the future.


## Insurance {#insurance}

-   Always buy pure health insurance and pure life insurance, never go for the combo ones.
-   Prefer direct plans over going through some agent.
-   Take the terms up-to 60 years, because after 60 years, your investments and your savings should cover your ass, otherwise you might as well die.
-   Health: This should be more correctly called sickness insurance.
-   Life: This is more of a income replacement insurance and not a life insurance. i.e. When you die and your income stops, this will supplement your income for your family.


## FIRE {#fire}

How much money you need to retire is called your FIRE portfolio

-   I'll be going with ****SWR(Safe Withdrawal Rate)**** : Estimated percentage of savings you're able to withdraw each year throughout retirement without running out of money.
-   It only includes invested assets that generates income. It is not your net worth.
-   If annual expenses(tax incl.) = 12L (Monthly 1L)
    -   WR(withdrawal rate of 4%) = 12/0.04 = 300L = 3Cr
    -   3Cr/12L = 25 years, with 3Cr, I'll be able to live a 12L/y lifestyle for 25 years.
-   If annual expenses(tax incl.) = 9L (Monthly 75k)
    -   WR(3%) = 9L/0.03 = 300L = 3Cr
    -   3Cr/9L = 33 years, with 3Cr, I'll be able to live a 9L/y lifestyle for 33 years.
-   3% WR is considered safe and my expense rate should be around 9L/y
-   So ****3Cr is my FIRE portfolio****, whenever I hit 3Cr, I can quit my job and working anymore for good. While talking to some people I realized that 3cr is nothing for them but it's more than enough for me.
-   I plan to save 75% for the next five years. But to stay safe, I've put 60% savings in the following screenshot.


## Tools and resources {#tools-and-resources}

-   [Early Retirement Calculator](https://networthify.com/calculator/earlyretirement?income=50000&initialBalance=0&expenses=20000&annualPct=5&withdrawalRate=4)
-   [Financial Independence/Early Retirement India](https://www.reddit.com/r/FIREIndia/)
-   [A place for Indians to discuss and evaluate Investments](https://www.reddit.com/r/IndiaInvestments/)
-   [Personal Finance](https://www.reddit.com/r/personalfinance/)
